k6/results/log-smoke_20260527_185312.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/scenarios/smoke/smoke.test.js
        output: InfluxDBv1 (http://localhost:8086)

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 1 iterations shared among 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2026-05-27T18:53:12-03:00" level=info msg="▶ [1/13] GET / — Root endpoint" source=console
time="2026-05-27T18:53:12-03:00" level=info msg="▶ [2/13] GET /health — Health check" source=console

running (00m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1 VUs  00m01.0s/10m0s  0/1 shared iters
time="2026-05-27T18:53:13-03:00" level=info msg="▶ [3/13] GET /communities — Listar comunidades" source=console
time="2026-05-27T18:53:13-03:00" level=info msg="▶ [4/13] GET /communities?biomeId=... — Filtrar por bioma" source=console

running (00m02.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1 VUs  00m02.0s/10m0s  0/1 shared iters
time="2026-05-27T18:53:14-03:00" level=info msg="▶ [5/13] POST /auth/login — Login com usuário seed" source=console
time="2026-05-27T18:53:14-03:00" level=info msg="▶ [6/13] GET /user/profile — Perfil do usuário" source=console

running (00m03.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1 VUs  00m03.0s/10m0s  0/1 shared iters
time="2026-05-27T18:53:15-03:00" level=info msg="▶ [7/13] GET /biomes — Listar biomas" source=console
time="2026-05-27T18:53:16-03:00" level=info msg="▶ [8/13] GET /categories — Listar categorias" source=console

running (00m04.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1 VUs  00m04.0s/10m0s  0/1 shared iters
time="2026-05-27T18:53:16-03:00" level=info msg="▶ [9/13] GET /events — Listar eventos" source=console
time="2026-05-27T18:53:17-03:00" level=info msg="▶ [10/13] GET /events/category/:categoryId — Eventos por categoria" source=console

running (00m05.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1 VUs  00m05.0s/10m0s  0/1 shared iters
time="2026-05-27T18:53:17-03:00" level=info msg="▶ [11/13] GET /alerts — Listar alertas" source=console
time="2026-05-27T18:53:18-03:00" level=info msg="▶ [12/13] GET /alerts/:alertId — Detalhe do alerta" source=console

running (00m06.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1 VUs  00m06.0s/10m0s  0/1 shared iters
time="2026-05-27T18:53:18-03:00" level=info msg="▶ [13/13] POST /alerts — Criar alerta" source=console

running (00m07.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1 VUs  00m07.0s/10m0s  0/1 shared iters
time="2026-05-27T18:53:19-03:00" level=info msg="▶ POST /auth/refresh — Renovar token" source=console
time="2026-05-27T18:53:19-03:00" level=info msg="✅ Smoke test concluído!" source=console


  █ THRESHOLDS 

    checks
    ✗ 'rate>0.99' rate=97.14%

    http_req_duration
    ✓ 'p(95)<2000' p(95)=122.38ms

    http_req_failed
    ✗ 'rate<0.01' rate=7.14%


  █ TOTAL RESULTS 

    checks_total.......: 35     4.95638/s
    checks_succeeded...: 97.14% 34 out of 35
    checks_failed......: 2.85%  1 out of 35

    ✓ [root] status 200
    ✓ [root] mensagem VERACIS
    ✓ [health] status 200
    ✓ [health] campo status ok
    ✓ [health] tempo de resposta < 500ms
    ✓ [communities] status 200
    ✓ [communities] tem campo data
    ✓ [communities] tempo de resposta < 1s
    ✓ [login] status 200
    ✓ [login] mfaRequired false
    ✓ [login] tempo de resposta < 2s
    ✓ [profile] status 200
    ✓ [profile] tem campo success
    ✓ [profile] tem campo data
    ✓ [profile] tempo de resposta < 1s
    ✓ [biomes] status 200
    ✓ [biomes] tem campo data
    ✓ [categories] status 200
    ✓ [categories] body é array
    ✓ [events] status 200
    ✓ [events] body é array
    ✓ [alerts] status 200
    ✓ [alerts] body é array
    ✓ [alerts] tempo de resposta < 1.5s
    ✓ [alert-detail] status 200
    ✓ [alert-detail] tem campo id
    ✗ [create-alert] status 201
      ↳  0% — ✓ 0 / ✗ 1
    ✓ [create-alert] tempo de resposta < 2s
    ✓ [refresh] status 200
    ✓ [refresh] success true

    HTTP
    http_req_duration..............: avg=36.13ms min=1.17ms med=13.11ms max=145.29ms p(90)=94ms    p(95)=122.38ms
      { expected_response:true }...: avg=34.56ms min=1.17ms med=12.85ms max=145.29ms p(90)=98.46ms p(95)=124.14ms
    http_req_failed................: 7.14%  1 out of 14
    http_reqs......................: 14     1.982552/s

    EXECUTION
    iteration_duration.............: avg=7.06s   min=7.06s  med=7.06s   max=7.06s    p(90)=7.06s   p(95)=7.06s   
    iterations.....................: 1      0.141611/s
    vus............................: 1      min=1       max=1
    vus_max........................: 1      min=1       max=1

    NETWORK
    data_received..................: 1.3 MB 184 kB/s
    data_sent......................: 9.9 kB 1.4 kB/s



running (00m07.1s), 0/1 VUs, 1 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  00m07.1s/10m0s  1/1 shared iters
time="2026-05-27T18:53:19-03:00" level=error msg="thresholds on metrics 'checks, http_req_failed' have been crossed"